admin/backend/models/CauHinh.php

    public static function getServer(){
        $cauHinh = CauHinh::findOne(16);
---
SELECT * FROM `lucky_cau_hinh` WHERE `id`=16