admin/backend/controllers/ConfigController.php

    public function actionBackground()
    {
        $model = CauHinh::findOne(CauHinh::BACKGROUND);
---
SELECT * FROM `lucky_cau_hinh` WHERE `id`=44

    public function actionUpdateBackground()
    {
        $model = CauHinh::findOne(CauHinh::BACKGROUND);
        $image = $this->saveImage($model);
        if (!is_null($image)){
            $model->image = $image;
        }
        $model->save();
---
SELECT * FROM `lucky_cau_hinh` WHERE `id`=44
UPDATE `lucky_cau_hinh` SET `image`='/assets/lucky/img/2024/07/25/_8WZKuXP7YrBJRSf8he_tPoHFFCxj6P5Q.png' WHERE `id`=44