admin/backend/controllers/RotationConfigController.php

    public function actionIndex()
    {
        $models = RotationConfig::find()->orderBy(['percentage'=>SORT_ASC])->andFilterWhere(['active'=>1,'status'=>1])->all();
        $data = [];
        /** @var RotationConfig $model */
        foreach ($models as $index=>$model) {
            $data []= [
                'id'=>$model->id,
                'text'=>$model->title,
                'fillStyle'=>$index%2==0?'#ff9fd6':'#ff36a9',
                'textStrokeStyle'=>'#DC0C83',
                'textFontWeight'=>900,
                'image'=>CauHinh::getServer().'/'.$model->image,
                'percentage'=>$model->percentage,
                'price'=>$model->price,
                'total_quantity'=>$model->total_quantity,
                'number'=>1,
                'size' => 360/count($models),
            ];
        }
        $setting = SettingUser::findOne(['user_id'=>$this->uid]);
---
SELECT * FROM `lucky_rotation_config` WHERE (`active`=1) AND (`status`=1) ORDER BY `percentage`
SELECT * FROM `lucky_setting_user` WHERE `user_id`=1