admin/backend/controllers/SettingController.php

   public function actionGetBackground()
   {
       $model = CauHinh::findOne(CauHinh::BACKGROUND);
---
SELECT * FROM `lucky_cau_hinh` WHERE `id`=44