admin/common/models/User.php

            }
            $quest = Quest::findOne(['type' => Quest::LOGIN]);
            if (!is_null($quest)) {
                $user_quest = QuestUser::findOne(['user_id' => $user->id, 'quest_id' => $quest->id]);
---
SELECT * FROM `lucky_quest_user` WHERE (`user_id`=1) AND (`quest_id`=1)